INSERT INTO warehouses (id, address) VALUES
(1, 'г. Москва, ул. Петровка, д. 2 (Центральный хаб)'),
(2, 'г. Санкт-Петербург, Невский пр., д. 15 (Северный хаб)'),
(3, 'г. Казань, ул. Баумана, д. 44 (Поволжье)'),
(4, 'г. Новосибирск, Красный пр., д. 100 (Сибирь)'),
(5, 'г. Сочи, ул. Навагинская, д. 8 (Южный регион)'),
(6, 'г. Екатеринбург, ул. Вайнера, д. 12 (Урал)');


INSERT INTO stock (variant_id, warehouse_id, quantity) VALUES
(1,1,10), (1,2,5), (2,1,15), (3,1,3), (4,1,20), (5,1,12), (6,1,8), (7,1,5), (8,1,10), (9,1,7);

SELECT setval('warehouses_id_seq', (SELECT MAX(id) FROM warehouses));